# Какие типы данных есть в python? И какие изменяемые и неизменяемые  ?
# int 
# str 
# float
# bool 

# set
# frozenset 
# list 
# dict
# tuple
############################################################

# Принципы ООП 

# ООП - Объекино ориентированная программирования 

# Наследование
# Инкапсуляция
# Палимарфизм    
# Абстракция         
############################################################


# Что такое inline кнопки в aiogram ?

# это кнопки которые приходят ввиде сообщения
############################################################


# Что такое Django ORM ? # Object-Relational Mapping
                         # Объектно-реляционное сопоставление 

# Это обработсчик базы данных, 

# он переводит наш models.py на язык SQL

############################################################

# С помощью какой технологии делается автодокументация DRF ?

# swagger 
# redoc
####################################################

# в чем отличие aiogram от других библеотек ?


# aiogram являетя ассинхронной библеотекой 
#####################################################


# 200 http код, что она озночает ?

# все ок 


# Что такое класс models.Model в django от которого мы наследуемся

# это абстракный класс в django от которого мы наследуемся 
####################################################################


# За что отвечает папки templates и static в django проекте ?

# templates - html 

# static - ccs, js, fonts, img, 

##################################################################

# что такое синхронность и ассинхронность ? 

# Синхронность: В синхронной программе задачи выполняются одна за другой, в строгом порядке. 
# Когда одна задача завершается, следующая начинается. Программа ждет, пока каждая задача не будет завершена, прежде чем переходить к следующей.
# Асинхронность: В асинхронной программе задачи могут выполняться параллельно, не дожидаясь завершения предыдущей задачи. 
# Это позволяет программе продолжать работу, даже если одна из задач занимает время на выполнение ввода-вывода или другой операции, которая блокирует выполнение.

# (aiogram.png)

####################################################################

# На каком паттерне проектирования построен Django?

# MVT, или Model-View-Template

#############################################################

# Назовите основные https запросы

# get 

# post 

# put 

# patch 

# delete



# 1) Напишите функцию, которая принимает список, из списка выдает случайное
# значение из списка и записывает результат в txt файл. Список language =
# ["Python", "Java", "Kotlin", "JavaScript", "C#","RUBY"]
# 2) У нас есть переменная text которая, хранит в себе текст:
# Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum
# has been the industry's standard dummy text ever since the 1500s, when an unknown
# printer took a galley of type and scrambled it to make a type specimen book. It has
# survived not only five centuries, but also the leap into electronic typesetting, remaining
# essentially unchanged. It was popularized in the 1960s with the release of Letraset
# sheets containing Lorem Ipsum passages, and more recently with desktop publishing
# software like Aldus PageMaker including versions of Lorem Ipsum.
# Откройте файл text.txt и запишите текст в файл 2 способами
# ДОП ЗАДАЧА:
# 3) Написать программу, которая откроет созданный в задаче 2 файл text.txt,
# скопирует весь текст и запишет его в новый файл wikipedia.txt .

# 4) Создайте модуль с двумя функциями, которые вычисляли бы периметр и
# площадь прямоугольника. Подключите этот модуль к основной программе и
# вызовите эти функции с аргументами.
# 5) У нас есть список lst = [1, 2, 3, 4 ,5, 6, 7, 8, 9, 10]. Написать функцию которая
# переворачивает список. И используйте эту функцию на другом файле
# 6) Написать функцию, которая принимает hour(час), min(минуту), sec(секунды). И
# вам нужно превратить их в секунды. Вызовите его на другом файле





#геттеры и сеттеры в python ?

#Python, которые позволяют получать и устанавливать значения атрибутов объекта. 
#Геттеры используются для получения значения атрибута, 
#а сеттеры - для установки значения атрибута.

#################################################################################################
# Что такое декораторы 
# Декораторы в Python - это специальные функции, которые позволяют изменять\
# поведение других функций или методов. 
# Они используются для добавления дополнительной функциональности к существующему коду без его изменения
 


# def my_decorator(func):
#     def wrapper():
#         print("Something is happening before the function is called.")
#         func()
#         print("Something is happening after the function is called.")
#     return wrapper

# @my_decorator
# def say_hello():
#     print("Hello!")

# say_hello()
####################################################################################

# что такое JWT token ?

# accses token = 

# refresh token =


# Что такое функция?
# Функция - это часть кода которая выполняет определённую функцию. Она работает только в том случае когда мы её вызываем!

